<template>
	<div data-depth="0.15" class="layer4">
<svg id="button_svg_app" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 112.43 116.93"><defs><linearGradient id="Áåçûìÿííûé_ãðàäèåíò_31" x1="1.96" y1="31.32" x2="110.47" y2="31.32" gradientUnits="userSpaceOnUse"><stop offset="0" stop-color="#ff2c9c"/><stop offset="0.31" stop-color="#fb289b"/><stop offset="0.6" stop-color="#f01d97"/><stop offset="0.88" stop-color="#dd0a91"/><stop offset="1" stop-color="#d3008d"/></linearGradient></defs><g id="Layer_2" data-name="Layer 2"><g id="Ñëîé_1" data-name="Ñëîé 1"><g><ellipse class="cls-1" cx="56.22" cy="86.22" rx="53.19" ry="30.71"/><path class="cls-2" d="M56.22,102c-14.17,0-28.34-3.11-39.13-9.34C6.07,86.3,0,77.66,0,68.33S6.07,50.36,17.09,44c21.58-12.46,56.68-12.46,78.25,0,11,6.36,17.09,15,17.09,24.33s-6.07,18-17.09,24.34h0C84.56,98.9,70.39,102,56.22,102Zm0-61.39c-13.07,0-26.14,2.87-36.09,8.62-9.07,5.23-14.07,12-14.07,19.09s5,13.86,14.07,19.1c19.9,11.49,52.29,11.49,72.2,0h0c9.08-5.24,14.07-12,14.07-19.1s-5-13.85-14.06-19.09C82.36,43.49,69.29,40.62,56.21,40.62Z"/><path class="cls-3" d="M110.47,46.56V31.33H107.6c-2.59-4.45-6.89-8.64-13-12.18C73.39,6.92,39,6.92,17.85,19.15c-6.13,3.54-10.43,7.73-13,12.18H2V46.48H2c0,8,5.25,16.09,15.88,22.23,21.19,12.23,55.54,12.23,76.73,0C105.18,62.59,110.47,54.58,110.47,46.56Z"/><path class="cls-4" d="M94.58,19.15C84,13,70.1,10,56.22,10v67.9c13.88,0,27.77-3,38.36-9.17s15.89-14.13,15.89-22.15V31.33H107.6C105,26.88,100.71,22.69,94.58,19.15Z"/><ellipse class="cls-5" cx="56.22" cy="31.32" rx="54.26" ry="31.32"/><path class="cls-2" d="M94.58,53.47C73.39,65.71,39,65.71,17.85,53.47,7.7,47.61,2.47,40,2,32.32,1.59,40.67,6.82,49.1,17.85,55.47,39,67.7,73.39,67.7,94.58,55.47c11-6.37,16.27-14.8,15.81-23.15C110,40,104.74,47.61,94.58,53.47Z"/><path class="cls-2" d="M27.1,42.29a2.47,2.47,0,0,1-1.59-2l.06-20.8c0-1.58,2.45-2.87,5.46-2.86s5.44,1.29,5.44,2.87l0,17.25,54.85-6.13c3-.33,5.85.66,6.47,2.21s-1.26,3.08-4.2,3.41L32.09,43.07a9.37,9.37,0,0,1-4.57-.58Z"/></g></g>
</g></svg>
</div>
</template>

<style scoped>
.cls-1{fill:#231f20;opacity:0.25;}.cls-2{fill:#fff;}.cls-3{fill:#ff2c9c;}.cls-4{fill:#b70083;}.cls-5{fill:url(#Áåçûìÿííûé_ãðàäèåíò_31);}
#button_svg_app {width: 5vw;position: absolute; left:36vw;top:73vh;}
@media (max-width: 1200px) {
	#button_svg_app {width: 11vw;left:15vw;top:68vh;}
}
</style>